app/views/posts/_post.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  <div class="card-header">
    <strong><%= User.find(post.user_id).email %></strong>