app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    pp @post.to_json

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("user_id", "text", "created_at", "updated_at", "avatar") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["text", "a"], ["created_at", "2023-11-26 20:21:08.327239"], ["updated_at", "2023-11-26 20:21:08.327239"], ["avatar", "crhdxjcpzawr5hl9vjdf.png"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "user_id" = ?, "updated_at" = ?, "avatar" = ? WHERE "posts"."id" = ?  [["user_id", 4], ["updated_at", "2023-11-28 00:52:58.504759"], ["avatar", "jagee6rmudktkhcmpyjg.jpg"], ["id", 4]]